In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine, text
import pymysql

print("\n### Step 1: Dropping, Creating, and Populating Employees Table ###\n")

# Establish database connection
engine = create_engine("mysql+pymysql://root:mysql@localhost/sakila", echo=False)

# Drop table if exists and create 'employees' table
with engine.connect() as conn:
    conn.execute(text("DROP TABLE IF EXISTS employees;"))
    print("Table dropped.")
    
    conn.execute(text("""
    CREATE TABLE employees (
        id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(100),
        department VARCHAR(50),
        salary DECIMAL(10,2),
        join_date DATE
    );
    """))
    print("Table created.")
    
    # Insert sample data with explicit commit
    conn.execute(text("""
    INSERT INTO employees (name, department, salary, join_date) VALUES
        ('Alice', 'HR', 60000, '2020-01-15'),
        ('Bob', 'Finance', 75000, '2019-03-10'),
        ('Charlie', 'IT', 90000, '2018-07-23'),
        ('David', 'HR', 62000, '2021-06-01'),
        ('Eve', 'Finance', 80000, '2022-09-12');
    """))
    conn.commit()
    print("Sample data inserted.")

### Step 1: Dropping, Creating, and Populating Employees Table ###

Table dropped.
Table created.
Sample data inserted.

In [2]:
print("\n### Step 2: Loading Data from MySQL into Pandas DataFrame ###\n")

# 1. Load data into Pandas DataFrame
df = pd.read_sql("SELECT * FROM employees;", engine)

# Display the final table
print("Data Loaded Successfully:")
display(df)

### Step 2: Loading Data from MySQL into Pandas DataFrame ###

Data Loaded Successfully:

   id     name department   salary   join_date
0   1    Alice         HR  60000.0  2020-01-15
1   2      Bob    Finance  75000.0  2019-03-10
2   3  Charlie         IT  90000.0  2018-07-23
3   4    David         HR  62000.0  2021-06-01
4   5      Eve    Finance  80000.0  2022-09-12

In [3]:
# 2. Using Parameterized Queries for Security
query = "SELECT * FROM employees WHERE department = %s"
df_filtered = pd.read_sql(query, engine, params=("HR",))
print("Filtered data loaded using parameterized query.")
display(df_filtered)

Filtered data loaded using parameterized query.

   id   name department   salary   join_date
0   1  Alice         HR  60000.0  2020-01-15
1   4  David         HR  62000.0  2021-06-01

In [4]:
# 3. Specifying Column Data Types for Optimization
df_optimized = pd.read_sql("SELECT * FROM employees;", engine, dtype={"id": int, "salary": float})
print("Data loaded with specified column types.")
display(df_optimized)

Data loaded with specified column types.

   id     name department   salary   join_date
0   1    Alice         HR  60000.0  2020-01-15
1   2      Bob    Finance  75000.0  2019-03-10
2   3  Charlie         IT  90000.0  2018-07-23
3   4    David         HR  62000.0  2021-06-01
4   5      Eve    Finance  80000.0  2022-09-12

In [5]:
print("\n### Step 3: Filtering, Aggregating, and Transforming Data ###\n")

# Filtering: Selecting employees with salary above 70000
df_filtered_salary = df[df["salary"] > 70000]
print("Employees with salary greater than 70000:")
display(df_filtered_salary)

# Filtering: Selecting employees who joined after 2020-01-01
df["join_date"] = pd.to_datetime(df["join_date"])
df_filtered_date = df[df["join_date"] > pd.to_datetime("2020-01-01")]
print("Employees who joined after 2020-01-01:")
display(df_filtered_date)

### Step 3: Filtering, Aggregating, and Transforming Data ###

Employees with salary greater than 70000:

   id     name department   salary   join_date
1   2      Bob    Finance  75000.0  2019-03-10
2   3  Charlie         IT  90000.0  2018-07-23
4   5      Eve    Finance  80000.0  2022-09-12

Employees who joined after 2020-01-01:

   id   name department   salary  join_date
0   1  Alice         HR  60000.0 2020-01-15
3   4  David         HR  62000.0 2021-06-01
4   5    Eve    Finance  80000.0 2022-09-12

In [6]:
# Aggregation: Average salary by department
df_avg_salary = df.groupby("department")["salary"].mean().reset_index()
print("Average salary by department:")
display(df_avg_salary)

# Aggregation: Total salary payout by department
df_total_salary = df.groupby("department")["salary"].sum().reset_index()
print("Total salary payout by department:")
display(df_total_salary)

Average salary by department:

  department   salary
0    Finance  77500.0
1         HR  61000.0
2         IT  90000.0

Total salary payout by department:

  department    salary
0    Finance  155000.0
1         HR  122000.0
2         IT   90000.0

In [7]:
# Transformation: Creating a new column with salary in thousands
df["salary_k"] = df["salary"] / 1000
print("Transformed data with salary in thousands:")
display(df)

# Transformation: Creating a new column categorizing salaries
df["salary_category"] = df["salary"].apply(lambda x: "High" if x > 75000 else "Medium" if x > 60000 else "Low")
print("Transformed data with salary categories:")
display(df)

Transformed data with salary in thousands:

   id     name department   salary  join_date  salary_k
0   1    Alice         HR  60000.0 2020-01-15      60.0
1   2      Bob    Finance  75000.0 2019-03-10      75.0
2   3  Charlie         IT  90000.0 2018-07-23      90.0
3   4    David         HR  62000.0 2021-06-01      62.0
4   5      Eve    Finance  80000.0 2022-09-12      80.0

Transformed data with salary categories:

   id     name department   salary  join_date  salary_k salary_category
0   1    Alice         HR  60000.0 2020-01-15      60.0             Low
1   2      Bob    Finance  75000.0 2019-03-10      75.0          Medium
2   3  Charlie         IT  90000.0 2018-07-23      90.0            High
3   4    David         HR  62000.0 2021-06-01      62.0          Medium
4   5      Eve    Finance  80000.0 2022-09-12      80.0            High

In [8]:
print("\n### Step 4: Exporting DataFrames to a Database ###\n")

# Example 1: Writing transformed data to a new table
df.to_sql("employees_transformed", engine, if_exists="replace", index=False, method='multi', chunksize=1000)
print("Transformed data exported to 'employees_transformed' table.")

### Step 4: Exporting DataFrames to a Database ###

Transformed data exported to 'employees_transformed' table.

In [9]:
# Ensure salary_k and salary_category columns exist
with engine.connect() as conn:
    existing_columns = [row[0] for row in conn.execute(text("SHOW COLUMNS FROM employees;")).fetchall()]
    
    if 'salary_k' not in existing_columns:
        conn.execute(text("ALTER TABLE employees ADD COLUMN salary_k DECIMAL(10,2);"))
    
    if 'salary_category' not in existing_columns:
        conn.execute(text("ALTER TABLE employees ADD COLUMN salary_category VARCHAR(50);"))
    conn.commit()
print("Ensured salary_k and salary_category columns exist in 'employees' table.")

# Example 2: Updating transformed column in the original table
with engine.connect() as conn:
    for index, row in df.iterrows():
        conn.execute(text("""
            UPDATE employees SET salary_k = :salary_k, salary_category = :salary_category WHERE id = :id
        """), {"salary_k": row["salary_k"], "salary_category": row["salary_category"], "id": row["id"]})
    conn.commit()
print("Transformed salary columns updated in 'employees' table.")

Ensured salary_k and salary_category columns exist in 'employees' table.
Transformed salary columns updated in 'employees' table.

In [10]:
# Example 3: Bulk Insert for Performance Efficiency
new_employees = pd.DataFrame([
    {"name": "Frank", "department": "IT", "salary": 95000, "join_date": "2023-05-15"},
    {"name": "Grace", "department": "Finance", "salary": 88000, "join_date": "2022-11-23"}
])
new_employees.to_sql("employees", engine, if_exists="append", index=False, method='multi', chunksize=1000)
print("New employees added using bulk insert.")

New employees added using bulk insert.

In [11]:
print("\n### Step 5: Optimizing Query Performance ###\n")

# Using Parameterized Queries to Prevent SQL Injection
def get_employees_by_department(department_name):
    query = text("SELECT * FROM employees WHERE department = :dept;")
    with engine.connect() as conn:
        result = conn.execute(query, {"dept": department_name})
        df_filtered = pd.DataFrame(result.fetchall(), columns=result.keys())
    print(f"Employees from {department_name} department:")
    display(df_filtered)

get_employees_by_department("Finance")

### Step 5: Optimizing Query Performance ###

Employees from Finance department:

   id   name department    salary   join_date salary_k salary_category
0   2    Bob    Finance  75000.00  2019-03-10    75.00          Medium
1   5    Eve    Finance  80000.00  2022-09-12    80.00            High
2   7  Grace    Finance  88000.00  2022-11-23     None            None

In [12]:
# Optimizing Query Execution using LIMIT and ORDER BY
query = text("SELECT * FROM employees ORDER BY salary DESC LIMIT 5;")
with engine.connect() as conn:
    result = conn.execute(query)
    df_top_salaries = pd.DataFrame(result.fetchall(), columns=result.keys())
print("Top 5 highest-paid employees:")
display(df_top_salaries)

Top 5 highest-paid employees:

   id     name department    salary   join_date salary_k salary_category
0   6    Frank         IT  95000.00  2023-05-15     None            None
1   3  Charlie         IT  90000.00  2018-07-23    90.00            High
2   7    Grace    Finance  88000.00  2022-11-23     None            None
3   5      Eve    Finance  80000.00  2022-09-12    80.00            High
4   2      Bob    Finance  75000.00  2019-03-10    75.00          Medium